# -----------------Сохранение данных в файл - это запись данных в файл.
# Извлечение данных из файла - чтение файла.
# Файл вывода - файл, куда сохраняются данные.
# Файл ввода - файл, откуда считываются данные.
# Данные сохраняются из переменных в файл, а так же извлекаются из файла в переменные.
#
#
# ----------------Методы доступа к файлам
# 1) Последовательный
# 2) Прямой или произвольный
#
# Последовательный проходит файлы один за другим, перескочить нельзя
# Прямой или произвольный - можно перескочить к любой порции данных, не читая предыдущие
#
#
# -----Работа с файлами
# 1) Сначала нужно открыть файл
# 2)Обработка файла (запись данных в файл, либо чтение данных из файла)
# 3)Закрыть файл
#
#
#
#
# ------------Имена файлов
# При создании файлов обязательно указывается имя файла
# Расширение файлов - короткие последовательности символов (jpg, txt, docx)
#
# ----Кодировка файлов
# Рекомендуется использоваться UTF-8
#
#
# ----Относительные и абсолютные пути
# Абсолютный путь - полный путь, показывающий точное место его расположения
# Указывать абсолютный путь нужно с диска, разделяя имена папок с помощью \
# D:\Data\MyFiles\picture.png
#
# Относительный путь - привязан к отправной точки, от которой будет идти путь
# Например абсолютный путь D:\Data\MyFiles\picture.png
# Относительный путь от Data будет MyFiles\picture.png
#
#


