# from tkinter import image_names
#
# Комплексные числа с заданной действительной и мнимой частью
# Каждому вещественному числу соответствует определённая точка числовой прямой, и наоборот
#
# real + imag j
#
# real – вещественная часть комплексного числа
#
# imag – мнимая часть комплексного числа, которая завершается j или J
#
# Создание комплексных чисел
# С помощью функции complex()
# Принимает вещественную и мнимую часть, либо строкое представление числа
#
# z1 = -3 + 2j              # создание на основе литерала
# z2 = complex(6, -8)       # z2 = 6 - 8j
# z3 = complex(0, 2.5)      # z3 = 2.5j
# z4 = complex(5, 0)        # z4 = 5 + 0j
# z5 = complex('3+4j')      # создание на основе строки
#
#
# Присутствуют все арифметические операции
#
# z1 = 1 + 3j
# z2 = -3 + 2j
#
# print('z1 + z2 =', z1 + z2)
# print('z1 - z2 =', z1 - z2)
# print('z1 * z2 =', z1 * z2)
# print('z1 / z2 =', z1 / z2)
# print('z1^20 =', z1**20)
#
# Можно совершать операции над комплекс и инт числами
#
#
# Методы real and imag
#
# z = 3+4j
#
# print('Действительная часть =', z.real)
# print('Мнимая часть =', z.imag)

# Для нахождения сопряженного комплексного числа conjugate()
#
# z = 3+4j
#
# print('Сопряженное число =', z.conjugate())




Модуль math работает с вещественными числами, с комлпексами работает cmath
При необходимости можно найти инфу о нем

Для работы с комплексами не нужно подключать модули

























